---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs
source: html/57ecc6c8-8881-bfa1-e5a5-93855b3da051.htm
---
# ExternalDataInstanceAddingIntoDocumentEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.